import Link from "next/link";

export default function Home() {
  return (
    <div className="bg-orange-50 ">
      <div className="h-screen flex justify-center items-center flex-col max-w-screen-sm mx-auto gap-2">
        <div className="text-lg font-bold">
          나를 찾기 위해 오셨군요. 그 시작을 응원해요
        </div>
        <div className="text-sm text-orange-400 font-semibold">
          밑미에서 나를 만나는 시간을 가져보세요
        </div>
        <Link
          href="#"
          className="bg-yellow-300 py-2 w-full max-w-96 flex text-center relative rounded-sm"
        >
          <span className="mx-auto text-base">카카오톡 계속하기</span>
          <svg
            className="absolute left-3 bottom-1"
            width="32"
            height="32"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M16 4C8.82 4 3 8.59 3 14.25c0 3.66 2.433 6.871 6.094 8.685-.2.686-1.28 4.418-1.323 4.71 0 0-.026.221.117.305.142.084.31.019.31.019.409-.057 4.743-3.102 5.493-3.63.75.106 1.521.161 2.309.161 7.18 0 13-4.589 13-10.25C29 8.59 23.18 4 16 4Z"
              fill="#000"
            ></path>
            <path
              d="M8.813 17.828c-.414 0-.75-.321-.75-.716v-4.456h-1.17a.736.736 0 0 1-.737-.734c0-.405.33-.735.736-.735h3.84c.407 0 .737.33.737.735 0 .405-.33.734-.736.734h-1.17v4.456c0 .395-.337.716-.75.716Zm6.576-.01c-.313 0-.552-.127-.624-.33l-.372-.973h-2.287l-.371.973c-.072.204-.311.33-.624.33-.164 0-.327-.035-.477-.103-.206-.096-.405-.358-.177-1.065l1.794-4.722c.126-.36.51-.73.998-.74.49.01.874.38 1 .74l1.794 4.72c.228.71.03.972-.177 1.067-.15.068-.313.104-.477.103Zm-1.39-2.632-.749-2.128-.75 2.128H14Zm3.251 2.533c-.396 0-.719-.309-.719-.688v-5.093c0-.414.344-.75.766-.75.422 0 .765.336.765.75v4.406h1.594c.397 0 .719.308.719.687 0 .38-.322.688-.719.688H17.25Zm4.167.1a.75.75 0 0 1-.75-.75v-5.131a.75.75 0 0 1 1.5 0v1.611l2.092-2.092a.582.582 0 0 1 .416-.167.74.74 0 0 1 .516.222c.132.13.21.3.22.475a.585.585 0 0 1-.165.457l-1.709 1.709 1.846 2.445a.743.743 0 0 1 .048.832.742.742 0 0 1-.646.37.744.744 0 0 1-.599-.298l-1.759-2.33-.26.26v1.636a.751.751 0 0 1-.75.75Z"
              fill="#FFE812"
            ></path>
          </svg>
        </Link>
        <Link href="/login">다른 계정으로 계속하기</Link>
        <Link href="/create-account">회워가입하기</Link>
      </div>
    </div>
  );
}
